app/views/questions/show.html.erb

SELECT  1 AS one FROM "answers" WHERE "answers"."question_id" = $1 LIMIT $2  [["question_id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
<ul>
  <% if @question.answers.empty? %>