app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @question = Question.find(params[:question_id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "answers" ("description", "created_at", "updated_at", "question_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Absolutely. It is alive."], ["created_at", "2017-08-30 18:36:09.777350"], ["updated_at", "2017-08-30 18:36:09.777350"], ["question_id", 3]]
---
  def create
    @question = Question.find(params[:question_id])

    @answer = Answer.new(answer_params)
    @answer.question = @question
  # if the question is saved correctly, it will send a notice. If it is not, it just goes back to the form page.
  if @answer.save