app/controllers/questions_controller.rb

  def index
    @questions = Question.order(created_at: :asc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)
    # if the question is saved correctly, it will send a notice. If it is not, it just goes back to the form page.
    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdg"], ["description", "asdg"], ["created_at", "2017-08-29 18:48:09.564524"], ["updated_at", "2017-08-29 18:48:09.564524"]]

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["description", "It is such a dry state, why is there any rain at any time during the year?"], ["updated_at", "2017-08-30 18:59:14.847420"], ["id", 7]]